---
kind: method
id: M:Autodesk.Revit.DB.ExportLayerKey.#ctor
source: html/a9289076-8461-430f-9cba-dd8be1736b41.htm
---
# Autodesk.Revit.DB.ExportLayerKey.#ctor Method

Constructs a new ExportLayerKey with default values.

## Syntax (C#)
```csharp
public ExportLayerKey()
```